// урок 08.07.2022
// Демонстрация решения
// 1/ Напишите программу, которая на вход
// 2. принимает число и выдаёт его квадрат (число
// умноженное на само себя).
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

int a = 4,
    b = -3,
    c = -7;

Console.WriteLine(a*a);
Console.WriteLine(b*b);
Console.WriteLine(c*c);

